{"sessions":[{"nid":1,"instructors":"Kevin Menard","room":"Workshop","body":"In this workshop we’ll run through how to run your own grid. We’ll discuss the various components of the grid and how all this works together. We’ll show how to run tests against the grid using both the RC and WebDriver protocols. Towards the end, we’ll show how you can customize your grid by adding in your own servlets to the admin console. And we’ll demonstrate real world use cases for the plugin architecture.","title":"Getting Started with Selenium Grid","start_date":"2012-04-16 09:00:00","end_date":"2012-04-16 12:00:00","time":"April 16 09:00 - 12:00"},{"nid":2,"instructors":"Daniel Wagner-Hall, Selenium Committers","room":"Workshop","body":"At the time of writing, the Selenium bug tracker has 945 open bugs. Around 10 new ones are filed each day. Part of the joy of open source is: if you have problems, you have all the tools to fix them. All of the tools, yes, and tools are useful. But imagine going to Ikea, and just getting a big box of tools and parts. What’s missing? The assembly guide! You have no idea how things fit together. Sure, you can try to work it out, but why guess when you can be shown! As many of the Selenium committers as we can gather together will sit down with you, and help *you* fix a bug in Selenium. We’ll show you how things fit together, and where you might want to look to get started, and pair with you to pick up a bug, and hopefully get your fix committed during the workshop!","title":"If Ikea made instructions for Selenium (or: How to fix bugs in Selenium for yourself)","start_date":"2012-04-16 13:00:00","end_date":"2012-04-16 16:00:00","time":"April 16 01:00 - 04:00"},{"nid":3,"instructors":"Simon Stewart","room":"Workshop","body":"If you’ve ever wanted to work on the code of the Selenium project, but found the whole thing a little daunting, this workshop is for you! Over the course of this workshop, we’ll take a tour of the codebase, look at the various moving parts and how they fit together, get comfy with the CrazyFun build grammar, and learn a little about the design philosophy of the project. Along the way, we’ll be writing some code, running some tests and hopefully having a little fun. You’ll walk away confident in making changes to the code, building Selenium from source, and ensuring that your changes don’t have any unexpected side effects! Participants must have a computer to use (or share) with Java 6 or later installed, a Java IDE of your choice (Eclipse and IntelliJ are both excellent possibilities) and the latest version of Firefox. It is also strongly recommended to have checked out the source code before attending this workshop.","title":"Contributing to Selenium","start_date":"2012-04-16 09:00:00","end_date":"2012-04-16 12:00:00","time":"April 16 09:00 - 12:00"},{"nid":4,"instructors":"Stephen Hardisty, Michelle D’Netto","room":"Workshop","body":"Selenium tests make up a large portion of the mechanism that gives Etsy the confidence to deliver site updates several times each day. This workshop aims to demonstrate how we create these tests with surprisingly little effort and how the same tests can be used on different parts of the site. We will write tests against the Etsy website using Ruby, Capybara and (of course) Selenium, therefore some prior programming experience is important! There may or may not be free t-shirts…","title":"Handmade Etsy Tests","start_date":"2012-04-16 13:00:00","end_date":"2012-04-16 16:00:00","time":"April 16 01:00 - 04:00"},{"nid":5,"instructors":"","room":"","body":"","title":"Registration and breakfast","start_date":"2012-04-17 08:00:00","end_date":"2012-04-17 09:00:00","time":"April 17 08:00 - 09:00"},{"nid":6,"instructors":"Simon Stewart, Jason Huggins","room":"","body":"","title":"Introduction and notices","start_date":"2012-04-17 09:00:00","end_date":"2012-04-17 09:15:00","time":"April 17 09:00 - 09:15"},{"nid":7,"instructors":"Andreas Tolf Tolfsen","room":"Track A","body":"The web is accessible anywhere; from the phone in your pocket to tablets, TVs and cars. As web developers we have a responsibility to ensure that the web stays open and accessible to everyone, regardless the kind of device being used. In developing countries mobile phone telenetworks are often built before traditional landlines offering broadband access, and ensuring that web sites work well on low-end mobile phones is an important social factor for spreading knowledge and bridging the world. Since the introduction of OperaDriver one year ago at this conference, it has taken many leaps forward in becoming device and product agnostic. The talk will demo and introduce Selenium support for all Opera devices, including baked-in support for a range of mobile emulators. Join this talk and learn how to bring the internet and testing to any device, anywhere.","title":"Testing the Web Anywhere: OperaDriver on Mobile Devices","start_date":"2012-04-17 09:20:00","end_date":"2012-04-17 09:55:00","time":"April 17 09:20 - 09:55"},{"nid":8,"instructors":"Anand Ramdeo","room":"Track A","body":"Robust test automation frameworks are not designed and developed upfront, they are evolved over time. I have found it useful to have vision for a robust, scalable and reliable framework – but focus should be on solving the current problem. In this talk, I will demonstrate how we can start with simple, fragile test scripts and continuously re-factor them to build a robust framework. In every stage of re-factoring (or design improvement cycle), I will discuss – What are the limitations of current state of automation code / framework? – What design improvements might overcome those limitations? – How best they can be implemented with web driver? – Implement and repeat cycle. Talk will begin with a recorded / exported script and will evolve in a decent framework by implementing page objects, components, workflow, domain objects, asserters and so on.","title":"One Step At A Time ","start_date":"2012-04-17 10:00:00","end_date":"2012-04-17 10:35:00","time":"April 17 10:00 - 10:35"},{"nid":9,"instructors":"Jim Evans","room":"Track A","body":"As new browsers start to appear (Silk, headless browsers, and so on), there are opportunities for creating new drivers. What are the best methods to use if you want to create your own driver? In this presentation, we will disect the Internet Explorer driver; examine the decisions made for its architecture, code structure, and technology choices; and use it to extrapolate the methods best suited to building a new browser driver from the ground up.\n","title":"Building a Driver: Lessons Learned From Developing the Internet Explorer Driver","start_date":"2012-04-17 10:40:00","end_date":"2012-04-17 11:15:00","time":"April 17 10:40 - 11:15"},{"nid":10,"instructors":"","room":"","body":"","title":"Break","start_date":"2012-04-17 11:15:00","end_date":"2012-04-17 11:35:00","time":"April 17 11:15 - 11:35"},{"nid":11,"instructors":"Mike Davis ","room":"Track A","body":"I am TL for a small team at Google. My team work with various product teams to help them release better software, faster. Helping teams to write useful integration tests is one great way to help them improve their development cycle. In this talk I will outline: How selenium & integration testing fits into our development cycle. Making web tests reliable, fast, easy to write, easy to read & easy to debug. How we get developers to write & maintain selenium tests.\n","title":"Using selenium to improve a teams development cycle","start_date":"2012-04-17 11:40:00","end_date":"2012-04-17 12:15:00","time":"April 17 11:40 - 12:15"},{"nid":12,"instructors":"Luke Daley","room":"Track A","body":"Geb is a browser automation solution for Groovy. It brings together the power of WebDriver, the elegance of jQuery content selection, the robustness of Page Object modelling and the expressiveness of the Groovy language. Geb enables more expressive, more concise, and (very importantly) more maintainable web tests.\n","title":"Geb - Very Groovy Browser Automation","start_date":"2012-04-17 12:20:00","end_date":"2012-04-17 12:55:00","time":"April 17 12:20 - 12:55"},{"nid":13,"instructors":"","room":"","body":"","title":"Lunch","start_date":"2012-04-17 13:00:00","end_date":"2012-04-17 13:55:00","time":"April 17 01:00 - 01:55"},{"nid":14,"instructors":"Jason Huggins","room":"Track A","body":"Mobile testing is different than desktop web testing. It needs the right tool for the job. In this case, we need robots. Lots of them. Lots of little robot fingers touching lots of little mobile device screens. In this talk, Jason Huggins will bring out some robots from his lab and demonstrate how you, too, can join in the robot revolution that will destroy civilization… and make a decent living testing mobile apps in the process.\n","title":"Robots: If You Can't Beat 'Em, Build 'Em. ","start_date":"2012-04-17 14:00:00","end_date":"2012-04-17 14:35:00","time":"April 17 02:00 - 02:35"},{"nid":15,"instructors":"Kristian Rosenvold","room":"Track A","body":"Unstable back-end systems? Changing data? Test and production two worlds apart? Based on real project experiences, this talk is about Selenium-based approaches to how quality can be achieved against all odds. With code.\n","title":"Building quality with foundations of mud","start_date":"2012-04-17 14:40:00","end_date":"2012-04-17 15:15:00","time":"April 17 02:40 - 03:15"},{"nid":16,"instructors":"","room":"","body":"","title":"Break","start_date":"2012-04-17 15:15:00","end_date":"2012-04-17 15:25:00","time":"April 17 03:15 - 03:25"},{"nid":17,"instructors":"Michael Klepikov","room":"Track A","body":"Web UI responsiveness is a very important part of great user experience. At the same time, it could be hard to achieve and easy to inadvertently break, as it is affected by a great number of nontrivial factors — variable network latency, browser-specific rendering algorithms, JavaScript garbage collection, to name a few. This talk (or workshop?) will focus on automated performance and latency testing for web frontends, using WebDriver. I will present best practices for measuring performance and latency, automating the tests to get reliable and repeatable results, and making sense of the data. We will also explore ways to monitor how the app performs for real users.\n","title":"Automated web app performance testing using WebDriver ","start_date":"2012-04-17 15:30:00","end_date":"2012-04-17 16:05:00","time":"April 17 03:30 - 04:05"},{"nid":18,"instructors":"Liz Keogh","room":"","body":"Keynote","title":"How to test the inside of your head","start_date":"2012-04-17 16:10:00","end_date":"2012-04-17 17:00:00","time":"April 17 04:10 - 05:00"},{"nid":19,"instructors":"","room":"","body":"The Welcome Party is being held at The Glasshouse Stores (55 Brewer Street, London W1F 9UL). Appetizers and drinks will be provided, and additional food available for purchase.","title":"Welcome Party","start_date":"2012-04-17 18:00:00","end_date":"2012-04-17 23:59:00","time":"April 17 06:00 - 11:59"},{"nid":20,"instructors":"","room":"","body":"","title":"Registration and breakfast","start_date":"2012-04-18 08:00:00","end_date":"2012-04-18 09:00:00","time":"April 18 08:00 - 09:00"},{"nid":21,"instructors":"Simon Stewart","room":"Track A","body":"Selenium: State of the Union","title":"Selenium: State of the Union","start_date":"2012-04-18 09:00:00","end_date":"2012-04-18 09:40:00","time":"April 18 09:00 - 09:40"},{"nid":22,"instructors":"Adam Christian, David Stark","room":"Track A","body":"Selenium Builder is a new Firefox plug-in for working with both Selenium 1 and 2. It has a clean and simple user interface for recording, playing back and editing scripts that allows you to seamlessly work with both versions of Selenium. Builder’s user interface is built on HTML and JQuery and is designed to be a lot cleaner and more streamlined compared to Selenium IDE. While not as fully featured as IDE (yet) it allows you to quickly record new scripts, edit steps, and try out scripts in-browser. Builder also currently supports exporting Selenium 2 tests to Java and Python and introduces a JSON-based format for storing tests to be opened and edited again later. Selenium Builder is still in beta, so your input and skill along with your suggestions are very much appreciated. Builder already supports Selenium extensions, and we want to develop a complete plugin system so that extra features such as Flash support can be added. We’re looking to find out from you: What would SB need to be integrated properly into the way you use Selenium right now? What would make you switch from Selenium IDE? How can Builder help you migrate to Selenium 2?","title":"Introducing Selenium Builder - the Future of Test Development ","start_date":"2012-04-18 09:45:00","end_date":"2012-04-18 10:20:00","time":"April 18 09:45 - 10:20"},{"nid":23,"instructors":"Noah Sussman","room":"Track A","body":"In 2006 a friend turned me on to a new test harness called Selenium. The framework had little documentation and ran inside a weird, janky frameset. But Selenium had two killer features: you didn’t need Windows administrator privileges to install it and it was the only free GUI-driven regression testing framework for Web sites. Five years later I find myself in the position of having used Selenium in a business context for almost half my career and nearly the entire lifetime of the tool. Selenium’s changed a lot, so have the Web sites it was designed to test, and so has the Web itself. I look forward to talking about how I have helped businesses leverage Selenium to manage change and increase their ability to adapt in the ever-evolving world of eCommerce.\n","title":"Selenium in the enterprise: what went right, what went wrong (so far) ","start_date":"2012-04-18 10:25:00","end_date":"2012-04-18 11:00:00","time":"April 18 10:25 - 11:00"},{"nid":24,"instructors":"Phil Calçado","room":"Track A","body":"As Functional Programming makes its way to the mainstream, it’s time to think about the best ways to use Selenium with these tools. The two major alternative languages for the JVM are Functional and, even though they all have very good integration with the Java object model, dealing with stateful objects soon becomes cumbersome and even takes away many of the actual benefits of Functional languages. In this talk we will explore the construction of Selenium test suítes using Clojure; leveraging higher-order functions and other functional features of the language, how to model page flow and how to tackle the inherently stateful nature of the browser.\n","title":"Writing Functional Tests in a Functional Way ","start_date":"2012-04-18 11:05:00","end_date":"2012-04-18 11:40:00","time":"April 18 11:05 - 11:40"},{"nid":25,"instructors":"","room":"","body":"","title":"Break","start_date":"2012-04-18 11:45:00","end_date":"2012-04-18 11:55:00","time":"April 18 11:45 - 11:55"},{"nid":26,"instructors":"Jeff Rogers, Dima Kovalenko","room":"Track A","body":"At Groupon we utilize a ‘Pluggable Test Infrastructure’, where we express tests using high-level behaviors, and avoid precise web actions like “click”. We build tests around behaviors and outcomes. The infrastructure “plugs in” multiple test implementations at runtime for multiple uses of the product, like web, mobile, API, and International. Given a logged in Groupon user When I choose to buy a deal Then I should be informed that my purchase was successful That test can be exercised on the website, an iPhone, and via the Groupon API. Instead of having three separate tests, we have one that describes our behavior, and three automated flows to drive it. For web, mobile, and international web, we utilize Selenium/Web-driver. For the API, we exercise the same behaviors on the back-end via curl. All of these are driven by the same high-level, natural language specifications. One test, multiple implementations. Our presentation will detail this strategy, the benefits (product quality + developer feedback), and the occasions to use it (and not use it).\n","title":"Pluggable Test Infrastructure ","start_date":"2012-04-18 12:00:00","end_date":"2012-04-18 12:35:00","time":"April 18 12:00 - 12:35"},{"nid":27,"instructors":"","room":"","body":"","title":"Lunch","start_date":"2012-04-18 12:35:00","end_date":"2012-04-18 13:35:00","time":"April 18 12:35 - 01:35"},{"nid":28,"instructors":"Ivan De Marino","room":"Track A","body":"In this talk we will discuss how to use PhantomJS as a backend for RemoteWebDriver. The main purpose is to speed up the execution of test scripts, getting rid of the _bloated heaviness_ of real web browsers, and substitute them with this lightweight headless browser that everyone is talking about.","title":"Speed up your Selenium tests with PhantomJS, the headless browser. ","start_date":"2012-04-18 13:40:00","end_date":"2012-04-18 14:15:00","time":"April 18 01:40 - 02:15"},{"nid":29,"instructors":"Dante Briones","room":"Track A","body":"I’ll present a summary of my recent experiences building a suite of automated tests for my client’s native iOS application. I’ll cover both the technical aspects, (including an overview of the toolchain, and issues I had setting up a continuous integration build), as well as the cultural ones (such as the challenges encountered when attempting to incorporate test automation into a development culture that traditionally has not included it.)","title":"The Restless Are Getting Native: Lessons Learned While Writing Automated Tests for an iOS App ","start_date":"2012-04-18 14:20:00","end_date":"2012-04-18 14:55:00","time":"April 18 02:20 - 02:55"},{"nid":30,"instructors":"Matt Wynne","room":"Track A","body":"Tools like Selenium make writing automated browser tests dead easy. Many teams never look further than this, and are satisfied with just replacing their laborious manual testing efforts with reliable Selenium scripts. They’ve missed a big opportunity. If your test scripts talk in terms of button clicks and form interactions, they are hiding what’s interesting about your tests – the language of your domain. These tests are also brittle, breaking easily as the site’s design evolves. In this entertaining talk Matt will show some very bad examples of browser automation scripts, and explain how using a higher level of abstraction – writing in the language of your domain – will create more happiness on your team.\n","title":"More Than Automation - How Good Acceptance Tests Can Make Your Team Happier ","start_date":"2012-04-18 15:00:00","end_date":"2012-04-18 15:35:00","time":"April 18 03:00 - 03:35"},{"nid":31,"instructors":"","room":"","body":"","title":"Break","start_date":"2012-04-18 15:35:00","end_date":"2012-04-18 15:45:00","time":"April 18 03:35 - 03:45"},{"nid":32,"instructors":"Alan Parkinson","room":"Track A","body":"Security Testing is often seen as a specialist skill or role, but there is a range of static and dynamic security analysis tools that can be used by testers to perform common security checks. Unfortunately the dynamic security analysis tools require manual exploratory testing and are not compatible with continuous integration. This presentation will show how the Zed Attack Proxy (ZAP) can be combined with browser automation tests to provide fast automated feedback on common security issues within web applications. The talk will take attendees through adapting existing Selenium based test suites, an overview of performing automated security analysis with ZAP, and incorporating this into Continuous Integration for fast identification of security issues as they are created.\n","title":"Automated Security Testing","start_date":"2012-04-18 15:50:00","end_date":"2012-04-18 16:25:00","time":"April 18 03:50 - 04:25"},{"nid":33,"instructors":"","room":"Track A","body":"Lightning Talks","title":"Lightning Talks","start_date":"2012-04-18 16:30:00","end_date":"2012-04-18 17:05:00","time":"April 18 04:30 - 05:05"},{"nid":34,"instructors":"","room":"","body":"TBD","title":"Closing Keynote","start_date":"2012-04-18 17:10:00","end_date":"2012-04-18 17:45:00","time":"April 18 05:10 - 05:45"},{"nid":35,"instructors":"Dan Cuellar","room":"Track B","body":"One of the biggest challenges in writing test automation scripts comes in keeping pace with the rapid changes of the application under test. One small “critical” change made by a dev at midnight can result in hours of painful investigation and test script repair for you the next morning(s). However, if you factor your tests properly you can write complex, reliable tests with only a few lines of code that not only test themselves using reflection, but also can be repaired in no time, and repurposed for other platforms. By factoring our selenium tests into scripts(test cases), a model (with hooks to WebElements), and libraries of user actions (e.g. flirt with this user, register, send a message, etc.) Zoosk can quickly write and repair tests for our rapidly-changing and frequently experimental site. The selenium model and library can even be swapped out for libraries that drive other devices (e.g. iPhone/iPad) and use the same scripts to test our mobile apps independently or simulataneously in conjunction with our selenium-automated website / Facebook app.","title":"Testing Rapidly Changing Applications With Self-Testing Object-Oriented Selenium Infrastructure","start_date":"2012-04-17 09:20:00","end_date":"2012-04-17 09:55:00","time":"April 17 09:20 - 09:55"},{"nid":36,"instructors":"","room":"Track B","body":"","title":"Open for Unconference Session","start_date":"2012-04-17 10:00:00","end_date":"2012-04-17 10:35:00","time":"April 17 10:00 - 10:35"},{"nid":37,"instructors":"Santiago\nSuarez Ordonez","room":"Track B","body":"A detailed guide to creating a mature and paralellizable automated test suite. This talk will cover things such as data independence, atomic tests, state generation, testing oriented pages, and will include sample code, demos, and funny cat memes.","title":"So You’re Automated… Now Let’s Make It Fast!","start_date":"2012-04-17 10:40:00","end_date":"2012-04-17 11:15:00","time":"April 17 10:40 - 11:15"},{"nid":38,"instructors":"","room":"Track B","body":"","title":"Open for Unconference Session","start_date":"2012-04-17 11:40:00","end_date":"2012-04-17 12:15:00","time":"April 17 11:40 - 12:15"},{"nid":39,"instructors":"Marcus Merrell","room":"Track B","body":"At Peoplefluent, we have trimmed our test maintenance overhead from ~40% to less than 3% by generating our Selenium Page objects at build-time. We use Java reflection to parse our (constantly changing) presentation layer, and generate these test artifacts, which map to our customer-facing product pages. This moves the conversation to the developer’s desk–when they change something that affects test automation, it either re-generates a new page object unnoticed, or it causes a compile-time failure, preventing them from even checking in code that will cause an automation error. As a side effect, we fully integrated our automation team with the check-ins, build processes, unit testing,and coding standards of the development team. We use the same development languages and tools, and, as a bonus, allowed any developer on the team to write, execute, and troubleshoot functional automation tests from their own workstation. This was accomplished using 100% open-source products (mainly Selenium), requiring only imagination, an investment of time, and a commitment to automating tests at the unit, integration, and functional layers. This presentation will walk through the decisions made leading to this effort, how it was done, and what would be required for any organization to be able to implement the same. We believe this is a completely new way to think about test automation, and it has allowed us to release our software with a degree of confidence we hadn’t known before!","title":"Self-Generating Test Artifacts for Selenium/WebDriver","start_date":"2012-04-17 12:20:00","end_date":"2012-04-17 12:55:00","time":"April 17 12:20 - 12:55"},{"nid":40,"instructors":"","room":"Track B","body":"","title":"Open for Unconference Session","start_date":"2012-04-17 14:00:00","end_date":"2012-04-17 14:35:00","time":"April 17 02:00 - 02:35"},{"nid":41,"instructors":"Andy Kriger","room":"Track B","body":"Clojure is a general-purpose LISP dialect that targets the Java Virtual Machine (JVM), the Common Language Runtime (CLR), and JavaScript (via ClojureScript) . Using the clj-webdriver library and the Read-Eval-Print loop (REPL), we can rapidly build browser tests for web applications. We will explore this vibrant space, looking at how to use clj-webdriver, how to combine the power of Clojure and the power of Selenium, and how to setup a Clojure/Selenium testing workflow.","title":"Selenium, meet Clojure","start_date":"2012-04-17 14:40:00","end_date":"2012-04-17 15:15:00","time":"April 17 02:40 - 03:15"},{"nid":42,"instructors":"Jesse Dowdle, David Tolley","room":"Track B","body":"Most engineering organizations include some level of continuous integration in their development process. The brutal truth is that far too often these efforts are plagued by unreliable tests, long feedback loops, and bad configuration management. Learn how AtTask decided to radically rethink their software development model, and by using open source and cloud solutions went from 3 days of acceptance testing to just minutes, providing feedback on thousands of selenium tests to every engineer in the organization. See how by leveraging publicly available tools, you can deliver hyper-scalability to your Continuous Integration framework and include selenium testing per commit to drive cycle time down in your organization.","title":"Massively Continuous Integration: From 3 days to 30 minutes","start_date":"2012-04-17 15:30:00","end_date":"2012-04-17 16:05:00","time":"April 17 03:30 - 04:05"}],"speakers":[{"uid":1,"full_name":"Adam Christian","title":"Director of web development at Sauce Labs","first_name":"Adam","last_name":"Christian","company":"Sauce Labs","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/adam-christian.jpg","bio":"I have spent the last 5 years geeking out on client side javascript --  deal with interesting edge cases everyday running JS in the cloud for sauce labs. Usually my talks involve me on stage rocking out to journey. I co-created an automation framework called Windmill in 2007, a Flex-Testing framework called flex-pilot in 2009, a Node.JS javascript automation framework in 2011 called Jellyfish. I like beer, and am happy to be attending SeleniumConf in London!","twitter":"@admc","website":""},{"uid":2,"full_name":"Alan Parkinson","title":"","first_name":"Alan","last_name":"Parkinson","company":"","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/selenium-logo.png","bio":"","twitter":"@alan_parkinson ","website":""},{"uid":3,"full_name":"David Stark","title":"Software developer at Sauce Labs","first_name":"David","last_name":"Stark","company":"","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/port2.png","bio":"","twitter":"","website":""},{"uid":4,"full_name":"Anand Ramdeo","title":"Principle Test Consultant at Atlantis Software","first_name":"Anand","last_name":"Ramdeo","company":"Atlantis Software","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/SeleniumConference.jpg","bio":"Anand Ramdeo is principal test consultant and founder of Atlantis Software. He has been working in software development and testing for around 12 years. He has played various roles such as individual contributor, manager, facilitator, trainer and consultant in many waterfall, iterative, transition-to-agile and agile projects. Anand is a big fan of open source test automation tools such as Selenium-WebDriver. He hosts workshops and provides training on test automation tools in London. He considers himself an exploratory tester and has used many tools in various languages & platforms to understand their limitations and use them wisely.Anand is a keen learner and continues to learn the craft of software testing by reading books, going to various testing conferences & informal meet-ups and by participating in Weekend and Weeknight testing events. He (and his wife Komal Joshi) loves to shares their knowledge and experience on their blog www.TestingGeek.com and on twitter @testinggeek ","twitter":"@testinggeek","website":"http://www.testinggeek.com"},{"uid":5,"full_name":"Andreas Tolf Tolfsen","title":"Systems Developer at Opera Software","first_name":"Andreas","last_name":"Tolf Tolfsen","company":"Opera Software ASA","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/tolfsen6.jpg","bio":" Andreas Tolf Tolfsen is a System Developer at Opera Software where he forges new browser automation tools, such as OperaDriver, a WebDriver implementation in the Selenium project, and large-scale testing frameworks. He loves good craftsmanship and music, especially in the form that involves wonderful sounds, strange plots, loud singing and ridiculous costumes (opera, the other one). He holds a BA in Musicology from the University of Oslo.\n","twitter":"@tolfsen","website":"http://sny.no/"},{"uid":6,"full_name":"Dante Briones","title":"Principal Consultant for Cochiva","first_name":"Dante","last_name":"Briones","company":"Cochiva","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/dante-briones-headshot.jpg","bio":"Dante has a passion not simply for making software, but for making software better.\n\nOver the course of his career, he has worked in industries including medical devices, finance, and telecoms while playing roles ranging from junior developer to CTO.  Dante now applies his many years of software development experience as Principal Consultant for Cochiva.\n\nA self-described \"developer who like to write tests\", he was bitten by the unit-testing bug back in 2002 during a six-year stint in London. He hasn’t delivered untested production code since.\n\nDante spends his working hours helping his clients improve the technical aspects of their development processes by leveraging various forms of automation, including test automation, deployment automation, and continuous integration.  He's also been known to help teams figure out how to improve their ways of working by acting as a development practices coach and facilitator. \n\nHe spends the rest of his time cooking or attempting to photograph his twin daughters.  Very occasionally he can be found snowboarding or driving around an autocross course at a perfectly safe and reasonable speed.  ","twitter":"@dantebriones","website":"http://dantebriones.com"},{"uid":7,"full_name":"Ivan De Marino","title":"Senior Software Engineer at Neustar Webmetrics","first_name":"Ivan","last_name":"De Marino","company":"Neustar Webmetrics","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/me-20100919.jpg","bio":"Ivan joined Neustar Webmetrics as a Senior Software Engineer to lead the Agent development team.\nThe Agent team is in charge of the back-end that runs all the jobs submitted to the Webmetrics\ncloud, and it's built on top of Selenium as well as other open source projects.\n\nHe held different software engineering roles in the web industry: from PHP websites, to Sys-Admin for University research institutes - from working on the Symbian network stack, to R&D on W3C Widgets runtimes and Browsers (Symbian, Maemo) at Orange Labs UK - from Front End development at Betfair, to Javascript runtimes at Neustar.\n\nAlso, he is one of the main contributors to PhantomJS, the headless browser. And most of the code he wrote in the last few years is publicly available on Github.\n\nIvan is based in London, UK - when he is not converting caffeine into code, he is either tweeting non-sense, cooking Italian delicacy or riding carbon-fiber bikes.\nHe holds a BA in Computer Science from the 'Università degli Studi di Napoli \"Federico II\".\n","twitter":"twitter.com/detronizator","website":"blog.ivandemarino.me"},{"uid":8,"full_name":"Jason Huggins","title":"Co-founder of Sauce Labs\nCo-creator of Selenium\n","first_name":"Jason","last_name":"Huggins","company":"Sauce Labs","picture":"http://saucelabs.com/images/people/jason-huggins.jpg","bio":"Jason Huggins co-founded Sauce Labs and is the resident “crazy idea guy”. Actually, his official title is “Executive Software Chef”. Prior to Sauce Labs, Jason was a Test Engineer at Google where he supported the grid-scale “Selenium Farm” for testing Google applications such as Gmail and Google Docs. Jason’s experience also includes time at ThoughtWorks in Chicago as a software developer. While at ThoughtWorks, Jason created the Selenium testing tool out of the need to cross-browser test a new in-house time and expense system. When not programming in Python or JavaScript, Jason enjoys hacking on Arduino-based electronics projects. Jason has spent time in New York City, LA, and the Bay Area, but Chicago is his kind of town.\n","twitter":"@hugs","website":""},{"uid":9,"full_name":"Jeff Rogers","title":"","first_name":"Jeff","last_name":"Rogers","company":"Groupon","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/selenium-logo.png","bio":"","twitter":"","website":""},{"uid":10,"full_name":"Dima Kovalenko","title":"","first_name":"Dima","last_name":"Kovalenko","company":"Groupon","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/selenium-logo.png","bio":"","twitter":"","website":""},{"uid":11,"full_name":"Jim Evans","title":"Lead member of technical staff at salesforce.com","first_name":"Jim","last_name":"Evans","company":"Salesforce","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/Jim_Evans_casual_small.jpg","bio":"Jim Evans has been involved in the software industry for over 20 years, and has been passionately involved in automated software testing for over 18. He has been a core contributor to the Selenium project for over 2 years, contributing to the .NET language bindings, and the IE driver. Having worked at such companies as Microsoft and Intuit, he recently started as a Lead Member of Technical Staff at Salesforce.com, where, in addition to his regular duties, he acts as a Selenium resource for people within the company.\nHaving grown up in the Atlanta, Georgia area, he now resides in Tampa, Florida with is wife and two children. When he's not coding, he enjoys ballroom dancing, and reminiscing about his days as a rock star and his appearances on various network TV shows.","twitter":"@jimevansmusic","website":""},{"uid":12,"full_name":"Kristian Rosenvold","title":"","first_name":"Kristian","last_name":"Rosenvold","company":"Zenior AS","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/litePortrett.jpg","bio":"","twitter":"@krosenvold","website":""},{"uid":13,"full_name":"Luke Daley","title":"Principal Engineer at Gradleware","first_name":"Luke","last_name":"Daley","company":"Gradleware","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/Luke-Daley-Square-Gray-400.jpg","bio":"Luke Daley is a member of the Gradleware engineering team. At Gradleware Luke works on Gradle (a JVM based build automation tool) and helps teams reach new levels of project automation and quality.\nLuke is the lead of the Geb project (a productivity focused Groovy browser automation/web testing tool) which he created in 2010. You'll also find Luke contributing to other Open Source projects such as Grails (a Groovy web development framework), Spock (a next generation testing framework for the JVM) and anything else that catches his attention. With a “results over rhetoric” ethos, Luke's focus is on tools that empower software professionals to deliver and innovate, not try to save them from themselves.\nOriginally from Australia, Luke now resides in London where he spreads his time among work, software crafstmanship, musicianship and cursing the local weather.","twitter":"@ldaley","website":"http://ldaley.com"},{"uid":14,"full_name":"Matt Wynne","title":"","first_name":"Matt","last_name":"Wynne","company":"","picture":"http://www.seleniumconf.org/wp-content/uploads/2012/03/530582428_36f804b317_m.jpg","bio":"Matt Wynne works as an independent consultant and coach, helping teams like yours to enjoy delivering amazing software. In his spare time he is a core developer on the Cucumber project. ","twitter":"@mattwynne","website":"http://mattwynne.net"},{"uid":15,"full_name":"Michael Klepikov","title":"Software Engineer at Google","first_name":"Michael","last_name":"Klepikov","company":"Google","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/security_photo.png","bio":"Michael Klepikov is a Software Engineer at Google, working on tools for automated web performance and latency testing, such as WebPageTest.org, as part of Google's Make The Web Faster initiative. Prior to Google, he worked at PTC on large scale enterprise design data management solutions. His MS in CS is from Moscow State University.\nHe enjoys travel, skiing, climbing, and old black and white movies.","twitter":"@MTWFG","website":""},{"uid":16,"full_name":"Mike Davis ","title":"","first_name":"Mike","last_name":"Davis","company":"Google","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/me.png","bio":"","twitter":"","website":""},{"uid":17,"full_name":"Noah Sussman","title":"","first_name":"Noah","last_name":"Sussman","company":"Etsy","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/noah_beard_big.jpg","bio":"","twitter":"","website":""},{"uid":18,"full_name":"Phil Calçado","title":"","first_name":"Phil","last_name":"Calçado","company":"","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/selenium-logo.png","bio":"","twitter":"","website":""},{"uid":19,"full_name":"Andy Kriger","title":"","first_name":"Andy","last_name":"Kriger","company":"","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/selenium-logo.png","bio":"","twitter":"","website":""},{"uid":20,"full_name":"Dan Cuellar","title":"","first_name":"Dan","last_name":"Cuellar","company":"Zoosk","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/photo-1.png","bio":"Dan is a lead software engineer who manages a team of qa engineers and software developers who test Zoosk, the internet's romantic social network. He is responsible for writing the web, iPhone, and iPad automated testing infrastructure which is used in nightly functional automation runs.\nBefore his current position, he worked at Microsoft on products such as Outlook for Mac and Office.com and earned his BS in Computer Science (Music Technology) from Carnegie Mellon in Pittsburgh, PA.","twitter":"","website":" htttp://www.facebook.com/joseph.daniel.cuellar/"},{"uid":21,"full_name":"Jesse Dowdle","title":"","first_name":"Jesse","last_name":"Dowdle","company":"AtTask Inc","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/dowdlemj_portrait-150x150.png","bio":"As Manager of Development at AtTask, Jesse Dowdle guides the engineering efforts of 60+ engineers in the U.S. and overseas. His diverse background includes prior work in curriculum development and video game design. Successful engineering at a face-paced startup requires constant research in emerging technologies. Jesse drives thought leadership on Continuous Integration, Automated Web Testing, and Process Enhancements to help AtTask ship software at lightning speed. Jesse is a native of Utah, where he enjoys fast european cars in the summer and snowboarding in winter.","twitter":"","website":""},{"uid":22,"full_name":"Marcus Merrell","title":"","first_name":"Marcus","last_name":"Merrell","company":"Peoplefluent","picture":"http://www.seleniumconf.org/wp-content/uploads/2012/03/Marcus-Merrell-Picture.jpg","bio":"Marcus Merrell has been in software development for 17 years, 11 of those spent in UI-focused test automation. He has led the implementation of automation frameworks for 3 companies, using platforms as diverse as SilkTest, Quicktest Pro, and finally (happily) Selenium. Before making the leap to eBay, he had recently completed the implementation of a robust, self-maintaining automation platform, which led to an unparalleled increase of velocity and coverage. He brings this experience to eBay in the hopes of applying lessons learned and the fundamentals of disciplined software design to a much larger environment.\n\nMarcus lives in Austin, TX with his wife and 2 children. When away from the keyboard he is a competitive amateur pianist, a dabbler in iPad app development, and a BBQ fanatic.","twitter":"@mmerrell","website":""},{"uid":23,"full_name":"Santiago\nSuarez Ordonez","title":"","first_name":"Santiago","last_name":"Suarez Ordonez","company":"Sauce Labs","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/santiago-ordonez.jpg","bio":"Santiago Suarez Ordonez is currently Customer Success Engineer and Selenium Ninja at Sauce Labs. For more than two years now, he has been helping Sauce's biggest customers get started with Selenium and accelerate their automation skills. Santi began his career as a manual tester, learning heavily structured and documented environments based in RUP procedures. Due to an obsession with squeezing every single second from repeatable and simple tasks, he became a GTD practitioner, Agile methodologies fan, and a skilled developer with an inclination to automated testing.","twitter":"@santiycr","website":""},{"uid":24,"full_name":"Simon Stewart","title":"Senior Software Engineer at Google and \ncreator of WebDriver\n","first_name":"Simon","last_name":"Stewart","company":"Google","picture":"https://lh6.googleusercontent.com/-g0H5xa974kQ/AAAAAAAAAAI/AAAAAAAAB9Y/2QTDg-d9lc8/s200-c-k/photo.jpg","bio":"Simon Stewart lives in London and works as a Software Engineer in Test at Google. His Open Source contributions centre on Selenium, where he’s one of the noisier members of the community and a core contributor to the project. It has been said before that Simon enjoys beer and writing better software, sometimes at the same time. This is true. He is also the top hit for the search term “steel cage knife fight”, a fact that makes in inordinately proud","twitter":"@shs96c","website":""},{"uid":25,"full_name":"Liz Keogh","title":"Lunivore Limited","first_name":"Liz","last_name":"Keogh","company":"Lunivore Limited","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/FJH_1244_cropped.jpg","bio":"Liz Keogh is an independent Lean / Agile coach, trainer and developer based in London. She is a well-known blogger and international speaker, a core member of the BDD community and a contributor to a number of open-source projects including JBehave.\nShe trains in subjects as diverse as story-writing, haiku poetry, systems thinking, effective personal feedback and OO development, and has a strong technical background with almost 15 years’ experience in delivering and coaching others to deliver large-scale enterprise applications, which she now combines with a focus on psychology, NLP and adult learning. She has pioneered the application of learning models in measuring Agile maturity and coaching progress, and is currently interested in modelling risk and change with complexity thinking and the Cynefin framework.\nLiz was awarded the Gordon Pask award in 2010 for deepening existing ideas in the Agile space and \"coming up with some pretty crazy ones of her own\". She is also a science fiction writer and haiku poet.","twitter":"@lunivore","website":""},{"uid":26,"full_name":"Kevin Menard","title":"Founder of MogoTest","first_name":"Kevin","last_name":"Menard","company":"MogoTest","picture":"http://www.seleniumconf.org/wp-content/uploads/2012/03/kevin_menard_headshot.jpg","bio":"Kevin is the founder of Mogotest, where he makes heavy use of Selenium Grid to build Web Consistency Testing tools.  He's a committer for the Selenium project and focuses much of his efforts on Selenium Grid. He's also an Apache Software Foundation member and contributor on many open source projects, such as fog and rubber, which simplify working with cloud environments in Ruby. He has a strong passion for improving the quality of Web applications and they way they're developed. \nWhen not programming, Kevin enjoys playing drums, running with his dog, and speaking foreign languages poorly.","twitter":"@nirvdrum","website":"http://github.com/nirvdrum"},{"uid":27,"full_name":"Daniel Wagner-Hall","title":"","first_name":"Daniel","last_name":"Wagner-Hall","company":"Google","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/02/dan2.jpg","bio":"Daniel Wagner-Hall works at Google as a Software Engineer in Test, working on Selenium, and building infrastructure to scale to providing millions of browser instances a day. He can generally be seen touching every piece of the codebase while trying [and often failing] not to break it too much, or seeking out  buildings named similarly to himself.  He will gladly trade bug-fixes for gin.","twitter":"@illicitonion","website":""},{"uid":28,"full_name":"Stephen Hardisty","title":"","first_name":"Stepehen","last_name":"Hardisty","company":"Etsy","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/02/selenium.jpg","bio":"Senior Software Developer at Etsy","twitter":"","website":""},{"uid":29,"full_name":"Michelle D’Netto","title":"","first_name":"Michelle","last_name":"D’Netto","company":"Etsy","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/02/selenium.jpg","bio":"Michelle is a resident Automation Engineer at Etsy, based in Brooklyn, New York. Originally from Australia, Michelle has over 6 years experience in the testing field and enjoys tackling new technologies, mastering her tool set and solving puzzles along the way. In her spare time she makes jewelry and often experiments with other forms of arts and crafts, sometimes with not so desirable outcomes.\n\n","twitter":"@mdnetto","website":""},{"uid":30,"full_name":"Selenium Committers","title":"","first_name":"","last_name":"Selenium Committers","company":"","picture":"","bio":"As many of the committers as we can gather together.","twitter":"@seleniumhq","website":""},{"uid":31,"full_name":"David Tolley","title":"","first_name":"David","last_name":"Tolley","company":"AtTask Inc.","picture":"http://www.seleniumconf.org/wp-content/uploads/2011/01/avatar.jpeg","bio":"After many years in a customer facing role, David developed a passion for providing a great customer experience. After deciding his future did not involve slinging legalized stimulants or pandering customers to buy over-priced protection plans, He received by B.S. in Computer Science from the University of Utah. Combining his love for computers and his drive to provide fantastic customer perceived quality, he traveled down the dark side that is automatic test development. His ultimate goal is for a customer to use a product he's tested and say \"It just works!\"","twitter":"","website":""}],"sponsors":[{"id":1,"name":"eBay","url":"http://www.ebay.com/","logo":"http://www.seleniumconf.org/wp-content/uploads/2010/12/ebay1.jpeg"},{"id":2,"name":"Google Open Source","url":"http://code.google.com/opensource/","logo":"http://www.seleniumconf.org/wp-content/uploads/2012/02/Google-Logo.jpg"},{"id":3,"name":"SOASTA","url":"http://soasta.com/","logo":"http://www.seleniumconf.org/wp-content/uploads/2012/02/Soasta.jpg"},{"id":4,"name":"Sauce Labs","url":"http://saucelabs.com/","logo":"http://www.seleniumconf.org/wp-content/uploads/2010/12/SauceLabs-Logo-Art22.jpg"},{"id":5,"name":"Software Quality Systems","url":"http://www.sqs.com/","logo":"http://www.seleniumconf.org/wp-content/uploads/2012/02/sqslogo-jpg.png"},{"id":6,"name":"W3QA","url":"http://www.w3qa.eu/","logo":"http://www.seleniumconf.org/wp-content/uploads/2010/12/w3qalogo.jpg"}],"locations":[{"id":1,"title":"Savoy Place (Venue)","subtitle":"2 Savoy Place, London WC2R 0BL","latitude":51.509849,"longitude":-0.119348},{"id":2,"title":"The Glasshouse Stores (Party)","subtitle":"55 Brewer Street, London W1F 9UL","latitude":51.511506,"longitude":-0.135485}]}